Revit 2016 API
BoundarySegment Properties
The BoundarySegment type exposes the following members.
Properties
Name | Description
Curve |  Obsolete.
Get the curve that is formed by the element that defines the edge of this area.
Document |  Obsolete.
Provides the document in which the element that created this segment resides.
Element |  Obsolete.
Retrieve the element that is responsible for producing this boundary segment.
ElementId
 Retrieve the id of the element that produces this boundary segment. If the segment is created from an element in a link, this is the id of the RevitLinkInstance.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LinkElementId
 Retrieve the element id of the element in a link instance that forms this boundary.
See Also
BoundarySegment Class
Autodesk.Revit.DB Namespace